src/cf/Documents/СамочувствиеСотрудника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>СамочувствиеСотрудника</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаЗамера</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПовышеннаяТемпература</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Самочувствие</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Создал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Температура</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаЗамера</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикУчетаСамочувствияСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/СамочувствиеСотрудника/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПриКопировании(ОбъектКопирования)
	
	Дата = ТекущаяДатаСеанса();
	ДатаЗамера = Дата;
	ТочкаЗамера = УчетСамочувствияСотрудниковСервер.ТочкаЗамераДляСотрудникаНаДату(Сотрудник, Дата);
	Создал = Сотрудники.ОсновнойСотрудник();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоНовый() Тогда 
		Сотрудник = Сотрудники.ОсновнойСотрудник();
		Создал = Сотрудник;
		Дата = ТекущаяДатаСеанса();
		ДатаЗамера = Дата;
		ТочкаЗамера = УчетСамочувствияСотрудниковСервер.ТочкаЗамераДляСотрудникаНаДату(
			Сотрудник, Дата);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПовышеннаяТемпература = Ложь;
	Если ЗначениеЗаполнено(Температура) И Температура >= 37 Тогда 
		ПовышеннаяТемпература = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПовышеннаяТемпература = Ложь;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СамочувствиеСотрудника.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.СамочувствиеСотрудника КАК СамочувствиеСотрудника
		|ГДЕ
		|	СамочувствиеСотрудника.Ссылка <> &ТекущийДокумент
		|	И СамочувствиеСотрудника.Проведен
		|	И СамочувствиеСотрудника.Сотрудник = &Сотрудник
		|	И СамочувствиеСотрудника.ДатаЗамера = &ДатаЗамера
		|	И СамочувствиеСотрудника.ТочкаЗамера = &ТочкаЗамера";
	Запрос.Параметры.Вставить("ТекущийДокумент", Ссылка);
	Запрос.Параметры.Вставить("ДатаЗамера", ДатаЗамера);
	Запрос.Параметры.Вставить("Сотрудник", Сотрудник);
	Запрос.Параметры.Вставить("ТочкаЗамера", ТочкаЗамера);
	Если Не Запрос.Выполнить().Пустой() Тогда 
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'На указанное время уже существует введенный замер.
			|Укажите другое время замера или сотрудника.'"),
			ЭтотОбъект,
			"ТочкаЗамера",, 
			Отказ);
	КонецЕсли;
	
КонецПроцедуры

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
